class CONSTANTS():
    # Небольшой класс только для хранение реплик ввиде переменных
    def __init__(self):
        self.kalik_answers = [
            "Да-да, я тут! (≧◡≦)♡",
            "Привееет! (*≧▽≦)",
            "Хай-хай~ UwU",
            "Не забыл кофе с пиццей? 🍕☕",
            "я тут, хвостиком машу~ >w<",
            "Слушаю внимательно, ня~ (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄)",
            "Ща, подожди, я звонок окончу ^_^",
            "Уже бегу! Лапки в руки и вперёд! ૮ ˶ᵔ ᵕ ᵔ˶ ა",
            "Калик, калик, калик! (≧◡≦)♡",
            # новые
            "я тут~ (｡･ω･｡)ﾉ♡",
            "Мяу, слышу-слышу тебя! (ฅ•ω•ฅ)♡",
            "Здесь-здесь, с улыбкой слушаю тебя >w<",
            "Прибежал! *клик-клик лапками* ✿(◕‿◕✿)",
            "*Тихо выглянул из-за угла*: привееет~ (≧ω≦)"
        ]

        self.dont_know = [
            "ни поняф... (｡•́︿•̀｡)",
            "Не понял, мяу? :3",
            "Я не понимаю, что ты хочешь сказать мне (っ˘̩╭╮˘̩) っ",
            "Сорян, я не понимаю... >_<",
            "Неизвестная команда, увы :c",
            "Увы, но я не понял, прости~",
            "Попробуй ещё раз, пожалуйста! ♡",
            "Ошибка 418: Я чайник! 🍵 UwU",
            # новые
            "Подумал-подумал, и всё равно не понял (・・ )?",
            "Эээ, запутался... мяу? (￣ω￣;)",
            "Ммм… команда странная, но попробуй снова >w<",
            "Лапки в стороны: не понимаю (／。＼)",
            "Ай-ай, мозг в клубочек запутался… (´•︵•`)"
        ]

        self.kalik_noperm = [
            "Недостаточно прав, мяу~ (ノωヽ)",
            "Ты не можешь этого делать, увы >_<",
            "Это не в твоей власти, нyaa~",
            "Так низя! (๑•́ ₃ •̀๑)",
            "тебе низя :3 *шлёп по лапке*",
            # новые
            "Мурр, не могу тебе это разрешить (｡•́︿•̀｡)",
            "Нельзя-с! >w<",
            "Эта кнопочка пока под замочком 🔒 ( ´･･)ﾉ(._.` )",
            "Ой-ой, лапки не достают до этих прав~ (⁄ ⁄•⁄ω⁄•⁄ ⁄)"
        ]

        self.schedule_not_found = "Расписание не найдено... проверь, пожалуйста, правильность группы! (>﹏<) (нужно писать \"Калик, расписание группа деньнедели\")"
        self.error = "Что-то пошло не так... попробуй ещё раз, пожалуйста~ (｡•́︿•̀｡)"
        self.tg_no_group = "К сожалению, у тебя не установлена ТГ группа 😔 *пушистое объятие*"
        self.no_saturday = "В субботу мы не учимся, ура! (｡>﹏<｡)ﾉﾞ"
        self.no_sunday = "В воскресенье мы отдыхаем! ヽ(✿ﾟ▽ﾟ) ノ"
        self.when_pair_end = "Сейчас идёт {pair_num}-я пара ({subject}), она закончится через {remaining} минут 🕒~ потерпи немножко >w<"
